# Отчет по лабораторной работе №1 по курсу "Фундаментальная информатика"

___Студент группы:___ М80-108Б-22 Сибирцев Роман Денисович \
___Контакты e-mail:___ sibirtsevr1@gmail.com \
___Работа выполнена:___ «17» декабря 2022 г. \
___Преподаватель:___ асп. каф. 806 Сахарин Никита Александрович \
___Входной контроль знаний с оценкой:___ 5 (отлично) \
___Отчет сдан___ «17» декабря 2022 г., ___итоговая оценка___ 5 (отлично)

Подпись преподавателя: ________________ 

## 1. Тема
_Обработка матриц_
## 2. Цель работы
_Составить программу на языке Си, производящую обработку квадратной матрицы порядка NxN (1 <= N <= 8), из целых чисел, вводимой из стандартного входного текстового файла_
## 3. Задание
_Умножение строки с минимальным элементом матрицы на столбец с максимальным элементом_
## 4. Оборудование
___Прицессор___: AMD Ryzen 5 3600 (12) @ 3.600GHz \
___ОП___: 15944MiB \
___HDD___: 1TB
## 5. Программное обеспечение
___Операционная система семейства___ UNIX, ___наименование___ Manjaro Linux, ___версия___  5.15.65-1-MANJARO
___Интерпритатор команд___ bash, ___версия___ 5.1.16
___Редактор текстов___ nano
## 6. Идея, метод, алгоритм решения

- Ввод размера матрицы;
- Создание матрицы;
- Написание функций, необходимых для выполнения задачи;
- Вывод ответа.


## 7. Сценарий выполнения работы
```c
#include <stdio.h>
#include <limits.h>

#define N (8)

int get_result (int n, int a[n][n]);
void input(int n, int a[n][n]);


void input(int n, int a[n][n]){
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            scanf("%d", &a[i][j]);
        }
    }
}

int get_result(int n, int a[n][n]) {
    int max_elem = INT_MIN, min_elem = INT_MAX;
    int mi, mj;
    int res = 0;
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            if (a[i][j] > max_elem) {
                max_elem = a[i][j];
                mj = j;
            }
            if (a[i][j] < min_elem) {
                min_elem = a[i][j];
                mi = i;
            }
        }
    }
    for (int i = 0; i < n; ++i) {
        res += a[mi][i] * a[i][mj];
    }
    printf("%d\n", res);
    return res;
}


int main(void) {
    int n;
    int a[N * N];
    scanf("%d", &n);
    input(n, (int (*)[n]) a);
    get_result(n, (int (*)[n]) a);
    return 0;
}
```

## 8. Распечатка протокола
```txt
3
1 2 3
4 5 6
7 8 9
42
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 17.12.22 | 13:00 | Выполнение лабораторной работы | - | - |

## 10. Замечания автора по существу работы

```c
#include <stdio.h>
#include <limits.h>
 
int get_deg(int a) {
    int i = 1;
    while (i < a) {
        i *= 2;
    }
    return i;
}
void get_result() {
    int n;
    int k;
    scanf("%d", &k);
    for (int j = 0; j < k; ++j) {
        scanf("%d", &n);
        int arr[n];
        printf("%d\n", n);
        for (int i = 0; i < n; ++i) {
            scanf("%d", &arr[i]);
 
            
            printf("%d %d\n", i + 1, get_deg(arr[i]) - arr[i]);
        }
    }
}
 
int main(void) {
    get_result();
}
```

## 11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и обработки их элементов.

Подпись студента _________________