# Отчет по лабораторной работе №1 по курсу "Фундаментальная информатика"

___Студент группы:___ М80-108Б-22 Сибирцев Роман Денисович \
___Контакты e-mail:___ sibirtsevr1@gmail.com \
___Работа выполнена:___ «17» декабря 2022 г. \
___Преподаватель:___ асп. каф. 806 Сахарин Никита Александрович \
___Входной контроль знаний с оценкой:___ 5 (отлично) \
___Отчет сдан___ «17» декабря 2022 г., ___итоговая оценка___ 5 (отлично)

Подпись преподавателя: ________________ 

## 1. Тема
_Вложенные циклы с параметрами. Обход и линеаризация матриц_
## 2. Цель работы
_Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода) с помощью вложенных циклов с переменными границами._
## 3. Задание
Вывести матрицу в соответствии с таблицей

| 7 | 6 | 5 | 16 |
| - | - | - | - |
| 8 | 1 | 4 | 15 |
| 9 | 2 | 3 | 14 |
| 10 | 11 | 12 | 13 |
## 4. Оборудование
___Прицессор___: AMD Ryzen 5 3600 (12) @ 3.600GHz \
___ОП___: 15944MiB \
___HDD___: 1TB
## 5. Программное обеспечение
___Операционная система семейства___ UNIX, ___наименование___ Manjaro Linux, ___версия___  5.15.65-1-MANJARO
___Интерпритатор команд___ bash, ___версия___ 5.1.16
___Редактор текстов___ nano
## 6. Идея, метод, алгоритм решения

- Ввод размера матрицы;
- Создание матрицы;
- Циклы для прохода по матрице;
- Вывод ответа.

## 7. Сценарий выполнения работы
```c
#include <stdio.h>

int n;

void solve(int a[n][n], int k) {
    int start_i = (k + k % 2) / 2 - 1;
    int start_j = (k + k % 2) / 2 - 1;

    int s = 0;
    int t = 1;
    int id = 1, id_i = 1, id_j = 0;
    printf("%d ", a[start_i][start_j]);
    while (s < n*n) {
        for (int z = 0; z < t; ++z) {
            if ((start_i + id * id_i >= 0) && (start_i + id * id_i < n) && (start_j + id * id_j >= 0) && (start_j + id * id_j < n)){
                
                start_i += id * id_i;
                start_j += id * id_j;
                printf("%d ", a[start_i][start_j]);
            }
        }
        if (id_j == 1) {
                id *= -1;
                t++;
            }
        id_i = 1 - id_i;
        id_j = 1 - id_j;
        s += t;
    }

}


int main(void) {
    scanf("%d", &n);
    int a[n][n];
    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            scanf("%d", &a[i][j]);
        }
    }

    for (int i = 0; i < n; ++i) {
        for (int j = 0; j < n; ++j) {
            printf("%d ", a[i][j]);
        }
        putchar('\n');
    }
    solve(a, n);
    putchar('\n');
    return 0;
}
```

## 8. Распечатка протокола
```txt
1 2 3 4 5 6 
7 8 9 10 11 12 
13 14 15 16 17 18 
19 20 21 22 23 24 
25 26 27 28 29 30 
31 32 33 34 35 36 
15 21 22 16 10 9 8 14 20 26 27 28 29 23 17 11 5 4 3 2 1 7 13 19 25 31 32 33 34 35 36 30 24 18 12 6 
```

## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 17.12.22 | 13:00 | Выполнение лабораторной работы | - | - |

## 10. Замечания автора по существу работы
```c
#include <stdio.h>

int k;

void solve(int a[k][k], int n) {
    int i, j;
    int old_n = n;
    n = k - n;
    int start_i = k - n;
    int start_j = k - n;
    int id_i = start_i;
    int id_j = k - start_j - 1;
    while (id_j >= start_j) {
        printf("%d ", a[id_i][id_j]);
        id_j -= 2;
    }
    id_j += 2;
    id_i += 2;
    while (id_i <= k - start_i - 1) {
        printf("%d ", a[id_i][id_j]);
        id_i += 2;
    }
    id_i -= 2;
    id_j += 2;
    while (id_j <= k - 1 - start_j) {
        printf("%d ", a[id_i][id_j]);
        id_j += 2;

    }
    id_j -= 2;
    id_i -= 2;
    while (id_i > start_i) {
        printf("%d ", a[id_i][id_j]);
        id_i -= 2;

    }
    id_i += 2;



    id_i = start_i;
    id_j = k - start_j - 1;
    id_j -= 1;
    while (id_j >= start_j) {
        printf("%d ", a[id_i][id_j]);
        id_j -= 2;
    }
    id_j += 1;
    id_i += 1;
    while (id_i <= k - start_i - 1) {
        printf("%d ", a[id_i][id_j]);
        id_i += 2;
    }
    id_i -= 1;
    id_j += 1;
    while (id_j <= k - 1 - start_j) {
        printf("%d ", a[id_i][id_j]);
        id_j += 2;

    }
    id_j -= 1;
    id_i -= 1;
    while (id_i >= start_i) {
        printf("%d ", a[id_i][id_j]);
        id_i -= 2;

    }
    id_i += 2;

    if (old_n <= k/2) {
        solve(a, old_n+1);
    }
}


int main(void) {
    scanf("%d", &k);
    int a[k][k];
    for (int i = 0; i < k; ++i) {
        for (int j = 0; j < k; ++j) {
            scanf("%d", &a[i][j]);
        }
    }

    for (int i = 0; i < k; ++i) {
        for (int j = 0; j < k; ++j) {
            printf("%d ", a[i][j]);
        }
        putchar('\n');
    }
    solve(a, 0);
    putchar('\n');
    return 0;
}
```

## 11. Выводы
Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и печати в строку всех их элементов.

Подпись студента _________________