# Отчет по лабораторной работе №12 по курсу "Фундаментальная информатика"
___Студент группы:___ М8О-108Б-22 \
___ФИО:___ Сибирцев Роман Денисович \
___Почта:___ sibirtsevr1@gmail.com \
___Преподаватель:___ Сахарин Никита Александрович 

### 1. Тема
Техника работы с целыми числами. Системы счисления.

### 2. Цель работы
Составить программу на языке Си в целом типе данных, которая для любых допустимых и корректно записаных чисел этого типа в десятичном изображении, поступающих на стандартный ввод программы, выполняет указанное вариантом действие над их значениями.

### 3. Задание

Поменять местамивторую и предпоследнюю цифры.

### 4. Оборудование
___Прицессор___: AMD Ryzen 5 3600 (12) @ 3.600GHz \
___ОП___: 15944MiB \
___SSD___: 1TB
___Монитор___: 1920:1080

### 5. Программное обеспечение
___Операционная система семейства___ UNIX, ___наименование___ Ubuntu Linux, ___версия___ 5.15.0-47-generic
___Интерпритатор команд___ bash, ___версия___ 5.1.16

### 6. Идея, метод, алгоритм решения


### 7. Сценарий выполнения работы

#### Тесты
```
1234 -> 1324
12 -> 21
9 -> 9
123456789 -> 183456729
```
#### Програма
```
#include <stdio.h>
#include <math.h>

int main(void) {
    int a = 0, n = 0, save;
    char ch;
    for (char ch = getchar(); ch != EOF; ch = getchar()) {
        if ((ch != ' ') && (ch != '\n') && (ch != '\t')) {
            ++n;
            a = a*10 + (int) (ch -  '0'); 
        } else {
            if (n > 1) {
                save = a % (int)pow(10, n - 1) / (int)pow(10, n - 2);
                a = a - save * (int)pow(10, n - 2) + (a % 100 / 10) * (int)pow(10, n - 2);
                a = a - (a % 100 / 10)*10 + save * 10;
            }
            printf("%d\n", a);
            a = 0;
            n = 0;
        }
    }
}
```

### 8. Распечатка протокола
```
123456789
183456729
9
9
1234  
1324
17
71
```


### 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 21.10.22 | 13:00 | Выполнение лабораторной работы | - | - |

### 10. Замечания автора по существу работы 
-
### 11. Выводы
Были получены навыки написания программ на Си, для работы с целыми числами.
