# Отчет по лабораторной работе №- по курсу "Фундаментальная информатика"
___Студент группы:___ М8О-108Б-22 \
___ФИО:___ Сибирцев Роман Денисович \
___Почта:___ sibirtsevr1@gmail.com \
___Преподаватель:___ Сахарин Никита Александрович 

### 1. Тема
##### Множества

### 2. Цель работы
Составить программу проверки характеристик введенных последовательностей слов в соответствии с вариантом задания

### 3. Задание
Есть ли два соседних слова с непересекающимся набором гласных ?

### 4. Оборудование
___Прицессор___: AMD Ryzen 5 3600 (12) @ 3.600GHz \
___ОП___: 15944MiB \
___SSD___: 1TB
___Монитор___: 1920:1080

### 5. Программное обеспечение
___Операционная система семейства___ UNIX, ___наименование___ Ubuntu Linux, ___версия___ 5.15.0-47-generic
___Интерпритатор команд___ bash, ___версия___ 5.1.16

### 6. Идея, метод, алгоритм решения


### 7. Сценарий выполнения работы
###### Тесты
```
qwerty ee e
```
###### Ответ 0
```
sedfg
sdfgdf
gdfg
f
```
###### Ответ 1
##### Программа
```
#include <stdio.h>
#include <ctype.h>

int main(void) {
    const unsigned int lu = 1;
    const unsigned int vowels = lu << ('a' - 'a') | lu << ('e' - 'a') | \
    lu << ('i' - 'a') | lu << ('o' - 'a') | lu << ('u' - 'a');

    unsigned int first_set = 0, second_set = 0;
    char low;
    int res = 0;

    for (char ch = getchar(); ch != EOF; ch = getchar()) {
        if ((ch != ' ') && (ch != '\t') && (ch != '\n') && (ch != '\0' && (ch != ','))) {
            low = tolower(ch);
            if ((low >= 'a') && (low <= 'z')) {
                first_set = first_set | (lu << (low - 'a'));
            }
        } else {
            if ((first_set & second_set) > 0) {
                res = 1;
            }
            first_set = first_set & vowels;
            second_set = first_set;
            first_set = 0;
        }
    }

    printf("%d\n", res);
}
```
### 8. Распечатка протокола

### 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 21.10.22 | 13:00 | Выполнение лабораторной работы | - | - |

### 10. Замечания автора по существу работы (— Написание команд для отработки навыков работы в ОС UNIX.)
### 11. Выводы
